//
//  ArticleMock.swift
//  enPiT2SUProduct
//
//  Created by Sion Park on 2022/12/30.
//

import Foundation
import UIKit

struct ArticleMock {
    
    private static let categories: [String] = [
        "重要",
        "小物",
        "電化製品",
        "衣類",
        "衣類小物",
        "お風呂・洗面",
        "化粧・ヘア",
        "薬・衛生品",
        "その他"
    ]
    
    private static let items : [[String]] = [
        ["スマホ","財布","クレジットカード","免許証","健康保険証"],
        ["ハンカチ","ポケットティッシュ","ウェットティッシュ","除菌シート","腕時計",
         "化粧ポーチ","メガネ","サングラス","コンタクトレンズ","マスク","日傘",
         "除菌ジェル","リュック","エコバッグ"],
        ["モバイルバッテリー","モバイルWiFi","PC","タブレット","スマホ充電器",
         "PC電源コード","カメラ","レンズ","三脚","イヤホン","ヘッドフォン","手持ち扇風機"],
        ["上着","レインウェア","肌着","下着","ベルト","靴下","パジャマ"],
        ["帽子","手袋","マフラー","ネクタイ","靴","ネックレス","指輪","イヤリング"],
        ["クレンジング","洗顔料","シャンプー","コンディショナー","ボディソープ",
         "ボディタオル","洗顔用ヘアゴム","タオル","歯ブラシセット","歯間ブラシ","カミソリ",
         "シェーバー","ハンドクリーム","ボディクリーム"],
        ["化粧水","乳液","ホワイトニング","美容液","オールインワン","化粧下地",
         "コンシーラー","BBクリーム","ファンデーション","パウダー","チーク",
         "アイシャドウ","マスカラ","アイブロウ","リップクリーム","口紅","鏡",
         "化粧ブラシ","ビューラー","スポンジ","コットン","ブラシ",
         "くし","ヘアゴム","ヘアピン","ヘアクリップ","ヘアバンド","整髪料",
         "ワックス","ドライヤー","ヘアアイロン"],
        ["絆創膏","常備薬","酔い止め","風邪薬","頭痛薬","腹痛薬","整腸薬",
         "目薬","湿布薬","塗り薬","虫刺されの薬","栄養剤",
         "コンタクト保存液","コンタクト洗浄液","マスク",
         "アイマスク","耳栓","爪切り","日焼け止め","生理用品","避妊具"],
        ["ビニール袋","ネックピロー","腰あて","S字フック","はし","スプーン","皿",
         "水","ドリンク","お菓子"]
    ]
    
    private static var addItems: [[String]] = [
        [],[],[],[],[],[],[],[]
    ]

    // 記事カテゴリーデータを表示する
    static func getArticleCategories() -> [String] {
        return categories
    }
    
    static func getArticleItems() -> [[String]] {
        return items
    }

    // 18個分のサンプルデータを作成する(引数にカテゴリーIDを渡す)
    static func getArticlesBy(categoryId: Int) -> [ArticleEntity] {

        var articles: [ArticleEntity] = []

        for i in 0...8 {
            articles.append(
                ArticleEntity.init(
                    id: i,
                    category: categories[categoryId],
                    items: items[categoryId]
                )
            )
        }
        return articles
    }
}
